src/cf/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ПолнотекстовыйПоискПоФайлам/Ext/Module.bsl
Процедура ОбновитьИндексСодержимымФайлов() Экспорт 


	Отбор = Новый Структура("Изменен", Истина);


	ВыборкаИзмененныхФайлов = Справочники.Файлы.Выбрать(,,Отбор);





	Пока ВыборкаИзмененныхФайлов.Следующий() Цикл


		Файл = ВыборкаИзмененныхФайлов.ПолучитьОбъект();


		Файл.Изменен = Ложь;





		Если Не РаботаСФайлами.ЭтоТекстовыйФайл(Файл.Наименование) Тогда


			Файл.Записать();


			Продолжить;


		КонецЕсли;





		ДвоичныеДанныеФайла = Файл.Хранилище.Получить();


		ЧтениеДанных = Новый ЧтениеДанных(ДвоичныеДанныеФайла);





		Файл.Содержание = ЧтениеДанных.ПрочитатьСимволы();


		Файл.Записать();





		ЧтениеДанных.Закрыть();


	КонецЦикла;





	ПолнотекстовыйПоиск.ОбновитьИндекс();


КонецПроцедуры
